trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/ЗаявкаВЕГАИСЛес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаВЕГАИСЛес</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПунктНазначенияЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеИЮрАдресЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДревесины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресРегистрацииФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерДекларацииЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПаспортСерияФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПаспортНомерФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГосНомерТСЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФИОФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a69ca45-0e55-4677-9e8c-10a91d895711">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0707329a-9fe5-4733-be0b-09fbb4099af3">
    <name>ЗаявкаСозданаНаОснованииПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	Если ПроверкаКлиента() = "ФизЛицо" тогда 
		ЭтаФорма.Элементы.ДляФИЗЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость=Ложь;
		ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость= РейсИЛИЗаказЕсть();
		ЭтаФорма.Элементы.ДляЮрЛица.Видимость = Ложь;
	Иначе
		Если ПроверкаКлиента() = "ЮрЛицо" тогда 
		ЭтаФорма.Элементы.ДляЮрЛица.Видимость = Истина;
		ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость=Ложь;
		ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость=Истина;
		ЭтаФорма.Элементы.ДляФИЗЛица.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.ДляЮрЛица.Видимость = Ложь;
		ЭтаФорма.Элементы.ДляФИЗЛица.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ПроверкаКлиента()
	
	Если ЗначениеЗаполнено(Объект.ТипКлиента) Тогда
		Если Объект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Возврат "ФизЛицо";
		Иначе Возврат "ЮрЛицо";
		КонецЕсли;
	КонецЕсли; 
	
КонецФункции   

&НаСервере
Процедура ПриОткрытииНаСервере()  
	
	Если Объект.Статус = Истина Тогда
		ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Ложь;
		ЭтаФОрма.Элементы.ГруппаЭлементыФормы.Доступность = Ложь;
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость(); 
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗанесеноВЕГАИСНаСервере()
	
	Если Объект.ТипКлиента = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо И НЕ ЗначениеЗаполнено(Объект.НомерДекларацииЮЛ)Тогда 
		Сообщить("Не заполнено поле «Номер декларации»");
		Возврат;
	КонецЕсли;
	
	Объект.Статус = Истина;	
	ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Ложь;
    ЭтаФОрма.Элементы.ГруппаЭлементыФормы.Доступность = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЗанесеноВЕГАИС(Команда)
	ЗанесеноВЕГАИСНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()	
    Документы.ЗаявкаВЕГАИСЛес.ЗаполнитьДанныеПоОснованию(Объект.Основание, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	УстановитьВидимость(); 
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	
	Объект.Статус = Ложь;	
	ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Истина;
	ЭтаФОрма.Элементы.ГруппаЭлементыФормы.Доступность = Истина; 
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
КонецПроцедуры

&НаСервере
Функция РейсИЛИЗаказЕсть()
	Возврат Документы.ЗаявкаВЕГАИСЛес.СуществуютРейсыИлиЗаказыНаДоставку(Объект.Основание);
КонецФункции
